Revit 2027 API
PlanCircuitSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	PlanCircuit item
)
Public Overridable Function Erase (
	item As PlanCircuit
) As Integer
public:
virtual int Erase(
	PlanCircuit^ item
)
abstract Erase :
        item : PlanCircuit -> int
override Erase :
        item : PlanCircuit -> int
Parameters
item PlanCircuit
The item to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace